
<a href="index.php">НА ГОЛОВНУ</a> <br><br>

<table border="1" width="800px" cellpadding="5">
    
   <tr>
    <td width="190px" rowspan="5">Розділ 5. Функції </td>
    <td width="70px">Задача 1</td>
    <td>Через форму передайте список імен, розділених комами, 
        заберіть зайві пробіли відсортуйте імена за алфавітом, 
        та виведіть відсортований список через кому та 1 пробіл. 
        Використайте власну функцію для коректного сортування 
        українських букв і,ї,є</td>
    <td width="80"><a href="5-functions/task1/namesList.php">Посилання<br>на розвязок</a></th>
   </tr>
   
   <tr>
    <td width="60px">Задача 2</td>
    <td>Потрібно додати сортування за ціною по зростанню та спаданню. 
        Використайте usort або uasort та власну функцію для порівняння 
        елементів</td>
    <td width="80"><a href="5-functions/task2/unit4_task2/index.php">Посилання<br>на розвязок</a></th>
   </tr>
   
   <tr>
    <td width="60px">Задача 3</td>
    <td>Через форму передайте список цілих чисел. Виведіть наступні результати:<br>
        1) Суму цих чисел;<br>
        2) Середнє значення (float);<br>
        3) Кількість парних чисел;<br>
        4) Всі непарні числа;</td>
    <td width="80"><a href="5-functions/task3/Integer.php">Посилання<br>на розвязок</a></th>
   </tr>
   
   <tr>
    <td width="60px">Задача 4</td>
    <td>Числами Фібоначі називають послідовність натуральних чисел, де перше 
        число 1, друге 1, а кожне наступне - це сума двох попередніх. 
        Виведіть перших 20 чисел Фібоначі. Задачу зробіть двома способами: 
        з рекурсією та без.</td>
    <td width="80"><a href="5-functions/task4/fibonacci.php">Посилання<br>на розвязок</a></th>
   </tr>
   
   <tr>
    <td width="60px">Задача 5</td>
    <td>Для товарів Задачі 2 додати поле discount (знижка) та поправити 
        виведдення ціни та сортування по ній. із урахуванням знижки</td>
    <td width="80"><a href="5-functions/task2/unit4_task2/index.php">Посилання<br>на розвязок</a></th>
   </tr>
   
   <tr>
    <td width="80px" rowspan="3">Розділ 6. Робота з файлами </td>
    <td>Задача 1</td>
    <td>Скопіюйте у директорію upload проекту більше файлів так щоб були файли 
        за різні дати. Модифікуйте скрипт так, щоб він перевіряв чи існує, і 
        якщо ні, то створював каталог backup. Допишіть код, який буде усі файли, 
        створені раніше ніж 3 дні назад переміщвати у папку backup.</td>
    <td rowspan="3"><a href="files/files.php">Посилання<br>на розвязок</a></td>
   </tr>
  
   <tr>
    <td>Задача 2</td>
    <td>Напишіть блок коду, який видалить у папці upload всі файли з 
        розширенням ".txt", які містять в середині слово "тест".</td>
   </tr>
   
   <tr>
    <td>Задача 3</td>
    <td>Напишіть скрипт, який зчитає текстовий файл source.txt та створить 
        і запише файл dest.txt У новому файлі усі слова (розділені пробілами 
        та переносами рядків) повинні бути записані із заду на перед.</td>
   </tr>
  
 </table>